# language: ru
Функционал: name
#  Чтобы вычислять сложные выражения
#  Пользователи хотят проводить вычисления над результатом предыдущей операций

  Предыстория:
    Допустим я сложил 3 и 5

  Сценарий: сложение с результатом последней операций
    Если я ввожу число 4
    И нажимаю "+"
    То результатом должно быть число 12

  Сценарий: деление результата последней операции
    Если я ввожу число 2
    И нажимаю "/"
    То результатом должно быть число 4

  Структура сценария: Целочисленное деление
    Допустим я ввожу число <делимое>
    И затем ввожу число <делитель>
    Если я нажимаю "/"
    То результатом должно быть число <частное>

  Примеры:
    | делимое | делитель | частное |
    | 100     | 2        | 50      |
    | 28      | 7        | 4       |
    | 0       | 5        | 0       |
